RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_ll_utils.c
/**
  ******************************************************************************
  * @file    stm32h7rsxx_ll_utils.c
  * @author  MCD Application Team
  * @brief   UTILS LL module driver.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32h7rsxx_ll_utils.h"
#include "stm32h7rsxx_ll_rcc.h"
#include "stm32h7rsxx_ll_pwr.h"

#ifdef  USE_FULL_ASSERT
#include "stm32_assert.h"
#else
#define assert_param(expr) ((void)0U)
#endif /* USE_FULL_ASSERT */

/** @addtogroup STM32H7RSxx_LL_Driver
  * @{
  */

/** @addtogroup UTILS_LL
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @addtogroup UTILS_LL_Private_Constants
  * @{
  */
#define UTILS_MAX_FREQUENCY_SCALE0  467000000U      /*!< Maximum frequency for system clock at power scale 0, in Hz */
#define UTILS_MAX_FREQUENCY_SCALE1  365000000U      /*!< Maximum frequency for system clock at power scale 1, in Hz */

/* Defines used for PLL range */
#define UTILS_PLLVCO_INPUT_MIN1          1000000U   /*!< Frequency min for the medium range PLLVCO input, in Hz   */
#define UTILS_PLLVCO_INPUT_MAX1          2000000U   /*!< Frequency max for the medium range PLLVCO input, in Hz   */
#define UTILS_PLLVCO_INPUT_MIN2          2000000U   /*!< Frequency min for the wide range PLLVCO input, in Hz  */
#define UTILS_PLLVCO_INPUT_MAX2          4000000U   /*!< Frequency max for the wide range PLLVCO input, in Hz  */
#define UTILS_PLLVCO_INPUT_MIN3          4000000U   /*!< Frequency min for the wide range PLLVCO input, in Hz  */
#define UTILS_PLLVCO_INPUT_MAX3          8000000U   /*!< Frequency max for the wide range PLLVCO input, in Hz  */
#define UTILS_PLLVCO_INPUT_MIN4          8000000U   /*!< Frequency min for the wide range PLLVCO input, in Hz  */
#define UTILS_PLLVCO_INPUT_MAX4         16000000U   /*!< Frequency max for the wide range PLLVCO input, in Hz  */

#define UTILS_PLLVCO_MEDIUM_OUTPUT_MIN 150000000U   /*!< Frequency min for the medium range PLLVCO output, in Hz  */
#define UTILS_PLLVCO_WIDE_OUTPUT_MIN   400000000U   /*!< Frequency min for the wide range PLLVCO output, in Hz */
#define UTILS_PLLVCO_MEDIUM_OUTPUT_MAX 420000000U   /*!< Frequency max for the medium range PLLVCO output, in Hz  */
#define UTILS_PLLVCO_WIDE_OUTPUT_MAX  1600000000U   /*!< Frequency max for the wide range PLLVCO output, in Hz */

/* Defines used for HSE range */
#define UTILS_HSE_FREQUENCY_MIN          4000000U   /*!< Frequency min for HSE frequency, in Hz   */
#define UTILS_HSE_FREQUENCY_MAX         50000000U   /*!< Frequency max for HSE frequency, in Hz   */

/* Defines used for FLASH latency according to HCLK Frequency at   */
/* VOS0 (highest power/frequency) or VOS1 (lowest power/frequency) */
#define UTILS_SCALE0_LATENCY0_FREQ      40000000U   /*!< HCLK frequency to set FLASH latency 0 in power scale 0  */
#define UTILS_SCALE0_LATENCY1_FREQ      80000000U   /*!< HCLK frequency to set FLASH latency 1 in power scale 0  */
#define UTILS_SCALE0_LATENCY2_FREQ     120000000U   /*!< HCLK frequency to set FLASH latency 2 in power scale 0  */
#define UTILS_SCALE0_LATENCY3_FREQ     160000000U   /*!< HCLK frequency to set FLASH latency 3 in power scale 0  */
#define UTILS_SCALE0_LATENCY4_FREQ     200000000U   /*!< HCLK frequency to set FLASH latency 4 in power scale 0  */
#define UTILS_SCALE0_LATENCY5_FREQ     234000000U   /*!< HCLK frequency to set FLASH latency 5 in power scale 0  */

#define UTILS_SCALE1_LATENCY0_FREQ      36000000U   /*!< HCLK frequency to set FLASH latency 0 in power scale 1  */
#define UTILS_SCALE1_LATENCY1_FREQ      72000000U   /*!< HCLK frequency to set FLASH latency 1 in power scale 1  */
#define UTILS_SCALE1_LATENCY2_FREQ     108000000U   /*!< HCLK frequency to set FLASH latency 2 in power scale 1  */
#define UTILS_SCALE1_LATENCY3_FREQ     144000000U   /*!< HCLK frequency to set FLASH latency 3 in power scale 1  */
#define UTILS_SCALE1_LATENCY4_FREQ     180000000U   /*!< HCLK frequency to set FLASH latency 4 in power scale 1  */
#define UTILS_SCALE1_LATENCY5_FREQ     183000000U   /*!< HCLK frequency to set FLASH latency 5 in power scale 1  */
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @addtogroup UTILS_LL_Private_Macros
  * @{
  */
#define IS_LL_UTILS_SYSCLK_DIV(__VALUE__) (((__VALUE__) == LL_RCC_SYSCLK_DIV_1)   \
                                           || ((__VALUE__) == LL_RCC_SYSCLK_DIV_2)   \
                                           || ((__VALUE__) == LL_RCC_SYSCLK_DIV_4)   \
                                           || ((__VALUE__) == LL_RCC_SYSCLK_DIV_8)   \
                                           || ((__VALUE__) == LL_RCC_SYSCLK_DIV_16)  \
                                           || ((__VALUE__) == LL_RCC_SYSCLK_DIV_64)  \
                                           || ((__VALUE__) == LL_RCC_SYSCLK_DIV_128) \
                                           || ((__VALUE__) == LL_RCC_SYSCLK_DIV_256) \
                                           || ((__VALUE__) == LL_RCC_SYSCLK_DIV_512))

#define IS_LL_UTILS_AHB_DIV(__VALUE__)    (((__VALUE__) == LL_RCC_AHB_DIV_1)   \
                                           || ((__VALUE__) == LL_RCC_AHB_DIV_2)   \
                                           || ((__VALUE__) == LL_RCC_AHB_DIV_4)   \
                                           || ((__VALUE__) == LL_RCC_AHB_DIV_8)   \
                                           || ((__VALUE__) == LL_RCC_AHB_DIV_16)  \
                                           || ((__VALUE__) == LL_RCC_AHB_DIV_64)  \
                                           || ((__VALUE__) == LL_RCC_AHB_DIV_128) \
                                           || ((__VALUE__) == LL_RCC_AHB_DIV_256) \
                                           || ((__VALUE__) == LL_RCC_AHB_DIV_512))

#define IS_LL_UTILS_APB1_DIV(__VALUE__) (((__VALUE__) == LL_RCC_APB1_DIV_1) \
                                         || ((__VALUE__) == LL_RCC_APB1_DIV_2) \
                                         || ((__VALUE__) == LL_RCC_APB1_DIV_4) \
                                         || ((__VALUE__) == LL_RCC_APB1_DIV_8) \
                                         || ((__VALUE__) == LL_RCC_APB1_DIV_16))

#define IS_LL_UTILS_APB2_DIV(__VALUE__) (((__VALUE__) == LL_RCC_APB2_DIV_1) \
                                         || ((__VALUE__) == LL_RCC_APB2_DIV_2) \
                                         || ((__VALUE__) == LL_RCC_APB2_DIV_4) \
                                         || ((__VALUE__) == LL_RCC_APB2_DIV_8) \
                                         || ((__VALUE__) == LL_RCC_APB2_DIV_16))

#define IS_LL_UTILS_APB4_DIV(__VALUE__) (((__VALUE__) == LL_RCC_APB4_DIV_1) \
                                         || ((__VALUE__) == LL_RCC_APB4_DIV_2) \
                                         || ((__VALUE__) == LL_RCC_APB4_DIV_4) \
                                         || ((__VALUE__) == LL_RCC_APB4_DIV_8) \
                                         || ((__VALUE__) == LL_RCC_APB4_DIV_16))

#define IS_LL_UTILS_APB5_DIV(__VALUE__) (((__VALUE__) == LL_RCC_APB5_DIV_1) \
                                         || ((__VALUE__) == LL_RCC_APB5_DIV_2) \
                                         || ((__VALUE__) == LL_RCC_APB5_DIV_4) \
                                         || ((__VALUE__) == LL_RCC_APB5_DIV_8) \
                                         || ((__VALUE__) == LL_RCC_APB5_DIV_16))

#define IS_LL_UTILS_PLLM_VALUE(__VALUE__) ((1U <= (__VALUE__)) && ((__VALUE__) <= 63U))

#define IS_LL_UTILS_PLLN_VALUE(__VALUE__) ((8U <= (__VALUE__)) && ((__VALUE__) <= 420U))

#define IS_LL_UTILS_PLLP_VALUE(__VALUE__) ((1U <= (__VALUE__)) && ((__VALUE__) <= 128U))

