RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_ll_utils.c
#define IS_LL_UTILS_FRACN_VALUE(__VALUE__) ((__VALUE__) <= 0x1FFFU)

#define IS_LL_UTILS_PLLVCO_INPUT(__VALUE__, __RANGE__) \
  ((((__RANGE__) == LL_RCC_PLLINPUTRANGE_1_2) && \
    (UTILS_PLLVCO_INPUT_MIN1 <= (__VALUE__)) && ((__VALUE__) <= UTILS_PLLVCO_INPUT_MAX1)) || \
   (((__RANGE__) == LL_RCC_PLLINPUTRANGE_2_4) && \
    (UTILS_PLLVCO_INPUT_MIN2 <= (__VALUE__)) && ((__VALUE__) <= UTILS_PLLVCO_INPUT_MAX2)) || \
   (((__RANGE__) == LL_RCC_PLLINPUTRANGE_4_8) && \
    (UTILS_PLLVCO_INPUT_MIN3 <= (__VALUE__)) && ((__VALUE__) <= UTILS_PLLVCO_INPUT_MAX3)) || \
   (((__RANGE__) == LL_RCC_PLLINPUTRANGE_8_16) && \
    (UTILS_PLLVCO_INPUT_MIN4 <= (__VALUE__)) && ((__VALUE__) <= UTILS_PLLVCO_INPUT_MAX4)))

#define IS_LL_UTILS_PLLVCO_OUTPUT(__VALUE__, __RANGE__) \
  ((((__RANGE__) == LL_RCC_PLLVCORANGE_MEDIUM) && \
    (UTILS_PLLVCO_MEDIUM_OUTPUT_MIN <= (__VALUE__)) && ((__VALUE__) <= UTILS_PLLVCO_MEDIUM_OUTPUT_MAX)) || \
   (((__RANGE__) == LL_RCC_PLLVCORANGE_WIDE) && \
    (UTILS_PLLVCO_WIDE_OUTPUT_MIN <= (__VALUE__)) && ((__VALUE__) <= UTILS_PLLVCO_WIDE_OUTPUT_MAX)))

#define IS_LL_UTILS_CHECK_VCO_RANGES(__RANGEIN__, __RANGEOUT__) \
  ((((__RANGEIN__) == LL_RCC_PLLINPUTRANGE_1_2) && \
    ((__RANGEOUT__) == LL_RCC_PLLVCORANGE_MEDIUM)) || \
   (((__RANGEIN__) != LL_RCC_PLLINPUTRANGE_1_2) && \
    ((__RANGEOUT__) == LL_RCC_PLLVCORANGE_WIDE)))

#define IS_LL_UTILS_PLL_FREQUENCY(__VALUE__) \
  ((LL_PWR_GetRegulVoltageScaling() == LL_PWR_REGU_VOLTAGE_SCALE0) ? \
   ((__VALUE__) <= UTILS_MAX_FREQUENCY_SCALE0) : ((__VALUE__) <= UTILS_MAX_FREQUENCY_SCALE1))

#define IS_LL_UTILS_HSE_BYPASS(__STATE__) \
  (((__STATE__) == LL_UTILS_HSEBYPASS_ON) || ((__STATE__) == LL_UTILS_HSEBYPASS_OFF))

#define IS_LL_UTILS_HSE_FREQUENCY(__FREQUENCY__) \
  (((__FREQUENCY__) >= UTILS_HSE_FREQUENCY_MIN) && ((__FREQUENCY__) <= UTILS_HSE_FREQUENCY_MAX))
/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/
/** @defgroup UTILS_LL_Private_Functions UTILS Private functions
  * @{
  */
static uint32_t    UTILS_GetPLLOutputFrequency(uint32_t PLL_InputFrequency,
                                               const LL_UTILS_PLLInitTypeDef *UTILS_PLLInitStruct);
static ErrorStatus UTILS_EnablePLLAndSwitchSystem(uint32_t SYSCLK_Frequency,
                                                  LL_UTILS_ClkInitTypeDef *UTILS_ClkInitStruct);
static ErrorStatus UTILS_IsPLLsNotBusy(void);
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup UTILS_LL_Exported_Functions
  * @{
  */

/** @addtogroup UTILS_LL_EF_DELAY
  * @{
  */
/**
  * @brief  This function configures the Cortex-M SysTick source to have 1ms time base.
  * @note   When a RTOS is used, it is recommended to avoid changing the Systick
  *         configuration by calling this function, for a delay use rather osDelay RTOS service.
  * @param  CPU_Frequency Core frequency in Hz
  * @note   CPU_Frequency can be calculated thanks to RCC helper macro or function
  *         @ref LL_RCC_GetSystemClocksFreq
  * @retval None
  */
void LL_Init1msTick(uint32_t CPU_Frequency)
{
  /* Use frequency provided in argument */
  LL_InitTick(CPU_Frequency, 1000U);
}


/**
  * @brief  This function provides accurate delay (in milliseconds) based
  *         on SysTick counter flag
  * @note   When a RTOS is used, it is recommended to avoid using blocking delay
  *         and use rather osDelay service.
  * @note   To respect 1ms timebase, user should call @ref LL_Init1msTick function which
  *         will configure Systick to 1ms
  * @param  Delay specifies the delay time length, in milliseconds.
  * @retval None
  */
void LL_mDelay(uint32_t Delay)
{
  uint32_t count = Delay;
  __IO uint32_t  tmp = SysTick->CTRL;  /* Clear the COUNTFLAG first */
  /* Add this code to indicate that local variable is not used */
  ((void)tmp);

  /* Add a period to ensure minimum wait */
  if (count < LL_MAX_DELAY)
  {
    count++;
  }

  while (count != 0U)
  {
    if ((SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) != 0U)
    {
      count--;
    }
  }
}

/**
  * @}
  */

/** @addtogroup UTILS_EF_SYSTEM
  *  @brief    System Configuration functions
  *
  @verbatim
 ===============================================================================
           ##### System Configuration functions #####
 ===============================================================================
    [..]
         System, AXI, AHB and APB buses clocks configuration

         (+) The maximum frequency of the SYSCLK is 464 MHz and HCLK is 232 MHz.
         (+) The maximum frequency of the PCLK1, PCLK2, PCLK4 and PCLK5 is 116 MHz.
  @endverbatim
  @internal
             Depending on the device voltage range, the maximum frequency should be
             adapted accordingly:
             (++) +---------------------------------------------------------------------------+
             (++) |  Wait states        |  AXI interface clock frequency (MHz) vs Vcore range |
             (++) |                     |-----------------------------------------------------|
             (++) |  (Latency)          |      voltage scale 1     |      voltage scale 0     |
             (++) |                     |       1.15V - 1.26V      |       1.26V - 1.40V      |
             (++) |---------------------|--------------------------|--------------------------|
             (++) | 0WS (1 CPU cycle)   |     0 < HCLK <= 36       |     0 < HCLK <= 40       |
             (++) |---------------------|--------------------------|--------------------------|
             (++) | 1WS (2 CPU cycles)  |    36 < HCLK <= 72       |    40 < HCLK <= 80       |
             (++) |---------------------|--------------------------|--------------------------|
             (++) | 2WS (3 CPU cycles)  |    72 < HCLK <= 108      |    80 < HCLK <= 120      |
             (++) |---------------------|--------------------------|--------------------------|
             (++) | 3WS (4 CPU cycles)  |   108 < HCLK <= 144      |   120 < HCLK <= 160      |
             (++) |---------------------|--------------------------|--------------------------|
             (++) | 4WS (5 CPU cycles)  |   144 < HCLK <= 180      |   160 < HCLK <= 200      |
             (++) |---------------------|--------------------------|--------------------------|
             (++) | 5WS (6 CPU cycles)  |   180 < HCLK <= 216      |   200 < HCLK <= 240      |
             (++) |---------------------|--------------------------|--------------------------|
             (++) | 6WS (7 CPU cycles)  |   216 < HCLK <= 252      |                          |
             (++) |---------------------|--------------------------|--------------------------|

